Revit 2027 API
BuiltInFailures.RoofFailures.HoleInRoofFailed Property
 Hole(s) could not be cut in roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HoleInRoofFailed { get; }
Public Shared ReadOnly Property HoleInRoofFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HoleInRoofFailed {
	FailureDefinitionId^ get ();
}
static member HoleInRoofFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace